docs/posts/2025-10-23-genuine-american-exceptionalism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Oct 23, 2025 05:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Genuine American Exceptionalism</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Genuine American Exceptionalism
<br />
<span class="subtitle">Oct 23, 2025 05:49</span>
</h1>
<blockquote>
<p>
The United States isn’t exceptional because of our common cultural heritage; we’re exceptional because we’ve been able to cohere despite faiths, traditions and languages that set us apart, and sometimes against one another. The drafters of the Constitution tried to create that cohesion by building a government that could transcend our divisions.
</p>
</blockquote>

<p class="source">
<a href="https://www.nytimes.com/2025/10/21/opinion/trump-diversity-culture-founders.html" class="source">Leighton Woodhouse</a>
</p>

<div class="tagline" id="org4f5212f">
<p>
Tagged:  <a href="../tags/politics.html">Politics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Oct 23, 2025 05:52.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
